package domain

var iataDict = map[string]string{
	// 🇷🇺 РОССИЯ (Крупные города и хабы)
	"MOW": "Москва",
	"LED": "Санкт-Петербург",
	"KZN": "Казань",
	"KUF": "Самара",
	"ULY": "Ульяновск",
	"NBC": "Нижнекамск",
	"VOG": "Волгоград",
	"OMO": "Омск",
	"GDX": "Магадан",
	"AER": "Сочи",
	"SVX": "Екатеринбург",
	"OVB": "Новосибирск",
	"KJA": "Красноярск",
	"PEE": "Пермь",
	"GOJ": "Нижний Новгород",
	"ROV": "Ростов-на-Дону",
	"KRR": "Краснодар",
	"UFA": "Уфа",
	"VVO": "Владивосток",
	"KHV": "Хабаровск",
	"IKT": "Иркутск",
	"KEJ": "Кемерово",
	"OMS": "Омск",
	"CEK": "Челябинск",
	"TYU": "Тюмень",
	"KGD": "Калининград",
	"MRV": "Минеральные Воды",
	"ASF": "Астрахань",
	"MCX": "Махачкала",
	"OGZ": "Владикавказ",
	"STW": "Ставрополь",
	"VOZ": "Воронеж",
	"GSV": "Саратов",

	// 🌍 СНГ и Ближнее Зарубежье
	"MSQ": "Минск",
	"ALA": "Алматы",
	"TSE": "Астана",
	"TAS": "Ташкент",
	"EVN": "Ереван",
	"GYD": "Баку",
	"TBS": "Тбилиси",
	"BUS": "Батуми",
	"FRU": "Бишкек",
	"DYU": "Душанбе",
	"KIV": "Кишинев",

	// 🏝️ ПОПУЛЯРНЫЙ ТУРИЗМ И КУРОРТЫ
	"IST": "Стамбул",
	"AYT": "Анталья",
	"DXB": "Дубай",
	"SHJ": "Шарджа",
	"HKT": "Пхукет",
	"BKK": "Бангкок",
	"DPS": "Бали (Денпасар)",
	"MLE": "Мальдивы (Мале)",
	"HRG": "Хургада",
	"SSH": "Шарм-эль-Шейх",
	"CMN": "Касабланка",
	"GOI": "Гоа",

	// 🇪🇺 ЕВРОПА И МИРОВЫЕ СТОЛИЦЫ
	"AMS": "Амстердам",
	"PAR": "Париж",
	"ROM": "Рим",
	"MIL": "Милан",
	"BCN": "Барселона",
	"MAD": "Мадрид",
	"BER": "Берлин",
	"FRA": "Франкфурт",
	"VIE": "Вена",
	"PRG": "Прага",
	"BUD": "Будапешт",
	"LON": "Лондон",
	"ATH": "Афины",
	"LIS": "Лиссабон",
	"NYC": "Нью-Йорк",
	"LAX": "Лос-Анджелес",
	"MIA": "Майами",
	"BJS": "Пекин",
	"TYO": "Токио",
	"SEL": "Сеул",

	// Специфические чартеры / Редкие коды, летящие в тестах
	"ELQ": "Гассим",
	"KRO": "Кротоне",
}

func GetCityNameByIATA(code string) string {
	if name, ok := iataDict[code]; ok {
		return name
	}
	return code
}
